In [2]:
import pandas as pd
import numpy as np
import plotly.express as px 
df1 = pd.DataFrame({'A':[1,2,3,4,12,25,45,85,45,45,78,54,1,25],
                    'B':[5,6,7,8,13,12,45,14,27,8,96,14,45,47],
                    'C':['c1','c1','c3','c3','c3','c3','b1','v1','v1','d1','d2','d2','d2','d1'],
                    'D':[0,1,0,1,0,1,0,0,0,1,1,0,1,0]})

## Duplicate Data

In [3]:
# داد های یکتا
df1['A'].unique()

array([ 1,  2,  3,  4, 12, 25, 45, 85, 78, 54])

In [4]:
# داده های تکراری
df1['A'].duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9      True
10    False
11    False
12     True
13     True
Name: A, dtype: bool

In [26]:
# از دومین داده تکراری شروع می شود
df1[df1['A'].duplicated()]

     A   B   C  D
8   45  27  v1  0
9   45   8  d1  1
12   1  45  d2  1
13  25  47  d1  0

In [28]:
# خذف داد های تکراری
df_uniq = df1.drop_duplicates(subset=['A'])
df_uniq

     A   B   C  D
0    1   5  c1  0
1    2   6  c1  1
2    3   7  c3  0
3    4   8  c3  1
4   12  13  c3  0
5   25  12  c3  1
6   45  45  b1  0
7   85  14  v1  0
10  78  96  d2  1
11  54  14  d2  0

In [29]:
# خذف داد های تکراری و نگه  داده
# keep = last , first , False
df_uniq = df1.drop_duplicates(subset=['A'], keep= 'first')
df_uniq

     A   B   C  D
0    1   5  c1  0
1    2   6  c1  1
2    3   7  c3  0
3    4   8  c3  1
4   12  13  c3  0
5   25  12  c3  1
6   45  45  b1  0
7   85  14  v1  0
10  78  96  d2  1
11  54  14  d2  0

In [5]:
data = [['ali',12],['shahin',14.86],['ali',15.3],['ali',14.2],['shahin',14.86],['dara',15.3],['fati',15.3],['ziba',17.1]]
df =pd.DataFrame(data,columns=['Name','code'],index=['1385','1386','1387','1388','1389','1390','1391','1392'])
df

        Name   code
1385     ali  12.00
1386  shahin  14.86
1387     ali  15.30
1388     ali  14.20
1389  shahin  14.86
1390    dara  15.30
1391    fati  15.30
1392    ziba  17.10

## بررسی همه دیتا

In [6]:
df.duplicated()
#  یعنی کل اطلاعات ردیف تکرار شده

1385    False
1386    False
1387    False
1388    False
1389     True
1390    False
1391    False
1392    False
dtype: bool

## بررسی ستون خاص

In [7]:
df.duplicated('Name')

1385    False
1386    False
1387     True
1388     True
1389     True
1390    False
1391    False
1392    False
dtype: bool

## بررسی دو ستون خاص

In [8]:
df.duplicated(['Name','code'])

1385    False
1386    False
1387    False
1388    False
1389     True
1390    False
1391    False
1392    False
dtype: bool

## Keep LAST or FIRST

In [9]:
## Keep Last
df.duplicated('Name',keep='last')

1385     True
1386     True
1387     True
1388    False
1389    False
1390    False
1391    False
1392    False
dtype: bool

In [10]:
df[df.duplicated('Name',keep='last')]

        Name   code
1385     ali  12.00
1386  shahin  14.86
1387     ali  15.30

In [11]:
df[-(df.duplicated('Name',keep='last'))]

        Name   code
1388     ali  14.20
1389  shahin  14.86
1390    dara  15.30
1391    fati  15.30
1392    ziba  17.10

In [12]:
## Keep First
df.duplicated('Name',keep='first')

1385    False
1386    False
1387     True
1388     True
1389     True
1390    False
1391    False
1392    False
dtype: bool

In [13]:
df[df.duplicated('Name',keep='first')]

        Name   code
1387     ali  15.30
1388     ali  14.20
1389  shahin  14.86

In [14]:
df[-(df.duplicated('Name',keep='first'))]

        Name   code
1385     ali  12.00
1386  shahin  14.86
1390    dara  15.30
1391    fati  15.30
1392    ziba  17.10

## Remove Duplicate

In [15]:
# default keep first
df.drop_duplicates('Name')

        Name   code
1385     ali  12.00
1386  shahin  14.86
1390    dara  15.30
1391    fati  15.30
1392    ziba  17.10